import streamlit as st


def show_about_page(logo):
    st.title("مرحباً بكم في نَصّي!")
    st.write(f"**{logo}**")

    st.subheader("رؤيتنا")
    st.write(
        "في موقع نَصّي، نسعى إلى تبسيط المعلومات وتسهيل الوصول إلى المعرفة بشكل مبتكر. "
        "هدفنا هو تمكين المستخدمين من فهم محتوى النصوص بشكل أعمق وسريع، من خلال أدوات تعتمد على الذكاء الاصطناعي."
    )

    st.subheader("ماذا نقدم؟")
    st.write(
        "يقدم موقع نَصّي حلولًا متكاملة لتحليل النصوص وتوفير إجابات دقيقة وملخصات وافية، "
        "لتلبية احتياجات المستخدمين في مختلف المجالات سواء كان ذلك في التعليم، البحث، أو الأعمال."
    )
